#include <stdio.h>
#include <stdlib.h>

int hikaku(const void *, const void *);

int main(void) {

  // 配列 kazu は、1 から 999 までの整数を要素とする
  // 要素数は 100 個
  int kazu[100] =
    {79, 83, 818, 164, 580, 307, 376, 993, 978, 466, 208, 215, 16, 235, 
     421, 59, 691, 703, 735, 434, 853, 426, 302, 348, 409, 569, 147, 548, 
     877, 880, 900, 108, 765, 893, 68, 58, 4, 916, 415, 130, 128, 670, 
     737, 196, 898, 305, 246, 366, 408, 234, 922, 786, 712, 306, 320, 771, 
     284, 977, 898, 917, 20, 89, 493, 849, 351, 720, 198, 986, 880, 74, 
     813, 159, 959, 384, 94, 716, 185, 295, 450, 557, 132, 278, 297, 615, 
     198, 457, 202, 551, 73, 996, 168, 3, 152, 412, 494, 140, 621, 538, 
     777, 164};
  int i;
  
  // 配列 kazu をソートする
  // 関数 hikaku により大小比較を行う
  // そのため、関数 hikaku のアドレスを第4引数として渡す
  qsort(kazu, 100, sizeof(int), hikaku);

  // 配列 kazu の80番目の要素を表示する
  printf("%d\n", kazu[79]);

  return (0);
}

// 関数 hikaku は大小比較を行う
// 「第1引数が指す整数」 < 「第2引数が指す整数」 の場合は -1 を返す
// 「第1引数が指す整数」 = 「第2引数が指す整数」 の場合は 0 を返す
// 「第1引数が指す整数」 > 「第2引数が指す整数」 の場合は 1 を返す
// ただし、第1引数と第2引数は、1 から 999 までの整数を指すアドレスとする
int hikaku(const void *arg0, const void *arg1){

  // 「第1引数が指す整数」と「第2引数が指す整数」を、
  // それぞれ、変数 a と b に代入する
  int a = *((int *)arg0);
  int b = *((int *)arg1);

  // 課題ではここに記述を加える
  if (a <= 9){
    a = a * 100;
  }else if (9 < a && a <= 99){
    a = a * 10;
  }
  if (b <= 9){
    b = b * 100;
  }else if (9 < b && b <= 99){
    b = b * 10;
  }

  // 整数 a と b の大小関係に応じて、
  // 返り値を -1, 1, 0 のいずれかとする
  if (a < b) {
    return (-1);
  }
  else if (a > b) {
      return (1);
  }
  else {
    return (0);
  }
}
